Revit 2024 API
PaperSourceSet Class
A set that can contain any number of paper source objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class PaperSourceSet : APIObject,
	IEnumerable
Visual Basic
Public Class PaperSourceSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class PaperSourceSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PaperSourceSet
See Also
PaperSourceSet Members
Autodesk.Revit.DB Namespace